{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"encoder_input": {"name": "encoder_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "7"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/encoder_1/mu_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/mu_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/sampling_1_1/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/log_var_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/log_var_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "7"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/Shape", "op": "Shape", "input": ["encoder_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/transpose", "op": "Transpose", "input": ["encoder_input", "StatefulPartitionedCall/encoder_1/lstm_4_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/Shape", "StatefulPartitionedCall/encoder_1/lstm_4_1/strided_slice/stack", "StatefulPartitionedCall/encoder_1/lstm_4_1/strided_slice/stack_1", "StatefulPartitionedCall/encoder_1/lstm_4_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/transpose", "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/strided_slice", "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/strided_slice", "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/zeros/packed", "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/zeros_1/packed", "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/while", "op": "While", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/while/loop_counter", "StatefulPartitionedCall/encoder_1/lstm_4_1/Max", "StatefulPartitionedCall/encoder_1/lstm_4_1/time", "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayV2_1", "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros", "StatefulPartitionedCall/encoder_1/lstm_4_1/zeros_1", "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayUnstack/TensorListFromTensor", "unknown", "unknown_0", "unknown_1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "_lower_using_switch_merge": {"b": false}, "cond": {"func": {"name": "__inference_encoder_1_lstm_4_1_while_cond_49729_frozen_830"}}, "parallel_iterations": {"i": "32"}, "_num_original_outputs": {"i": "10"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "64"}]}, {"dim": [{"size": "-1"}, {"size": "64"}]}, {}, {"dim": [{"size": "7"}, {"size": "256"}]}, {"dim": [{"size": "256"}]}, {"dim": [{"size": "64"}, {"size": "256"}]}]}}, "_read_only_resource_inputs": {"list": {"i": ["7", "8", "9"]}}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/while:3", "StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "20"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_4_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/encoder_1/lstm_4_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/encoder_1/lstm_4_1/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/encoder_1/lstm_5_1/Shape", "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice/stack", "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice/stack_1", "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice", "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice", "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/encoder_1/lstm_5_1/zeros/packed", "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/encoder_1/lstm_5_1/zeros_1/packed", "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/while", "op": "While", "input": ["StatefulPartitionedCall/encoder_1/lstm_5_1/while/loop_counter", "StatefulPartitionedCall/encoder_1/lstm_5_1/Max", "StatefulPartitionedCall/encoder_1/lstm_5_1/time", "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayV2_1", "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros", "StatefulPartitionedCall/encoder_1/lstm_5_1/zeros_1", "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayUnstack/TensorListFromTensor", "unknown_2", "unknown_3", "unknown_4"], "attr": {"_has_manual_control_dependencies": {"b": true}, "cond": {"func": {"name": "__inference_encoder_1_lstm_5_1_while_cond_49946_frozen_828"}}, "_lower_using_switch_merge": {"b": false}, "parallel_iterations": {"i": "32"}, "_num_original_outputs": {"i": "10"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_encoder_1_lstm_5_1_while_body_49947_frozen_829"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "32"}]}, {"dim": [{"size": "-1"}, {"size": "32"}]}, {}, {"dim": [{"size": "64"}, {"size": "128"}]}, {"dim": [{"size": "128"}]}, {"dim": [{"size": "32"}, {"size": "128"}]}]}}, "_read_only_resource_inputs": {"list": {"i": ["7", "8", "9"]}}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/encoder_1/lstm_5_1/while:3", "StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/encoder_1/lstm_5_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice_3/stack", "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice_3/stack_1", "StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/encoder_1/mu_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice_3", "StatefulPartitionedCall/encoder_1/mu_1/Cast/ReadVariableOp", "StatefulPartitionedCall/encoder_1/mu_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/log_var_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/encoder_1/lstm_5_1/strided_slice_3", "StatefulPartitionedCall/encoder_1/log_var_1/Cast/ReadVariableOp", "StatefulPartitionedCall/encoder_1/log_var_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/encoder_1/mu_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/sampling_1_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/encoder_1/mu_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/encoder_1/log_var_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/sampling_1_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/encoder_1/sampling_1_1/mul/x", "StatefulPartitionedCall/encoder_1/log_var_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/sampling_1_1/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/encoder_1/sampling_1_1/Shape"], "attr": {"seed2": {"i": "0"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/sampling_1_1/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/encoder_1/sampling_1_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/sampling_1_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/encoder_1/sampling_1_1/random_normal/RandomStandardNormal", "StatefulPartitionedCall/encoder_1/sampling_1_1/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder_1/sampling_1_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/encoder_1/mu_1/BiasAdd", "StatefulPartitionedCall/encoder_1/sampling_1_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/encoder_1/sampling_1_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827", "inputArg": [{"name": "encoder_1_lstm_4_1_while_encoder_1_lstm_4_1_while_loop_counter", "type": "DT_INT32"}, {"name": "encoder_1_lstm_4_1_while_encoder_1_lstm_4_1_max", "type": "DT_INT32"}, {"name": "encoder_1_lstm_4_1_while_placeholder", "type": "DT_INT32"}, {"name": "encoder_1_lstm_4_1_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "encoder_1_lstm_4_1_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_4_1_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_4_1_while_tensorarrayv2read_tensorlistgetitem_encoder_1_lstm_4_1_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "encoder_1_lstm_4_1_while_lstm_cell_1_split_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_4_1_while_lstm_cell_1_split_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_4_1_while_lstm_cell_1_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "encoder_1_lstm_4_1_while_identity", "type": "DT_INT32"}, {"name": "encoder_1_lstm_4_1_while_identity_1", "type": "DT_INT32"}, {"name": "encoder_1_lstm_4_1_while_identity_2", "type": "DT_INT32"}, {"name": "encoder_1_lstm_4_1_while_identity_3", "type": "DT_VARIANT"}, {"name": "encoder_1_lstm_4_1_while_identity_4", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_4_1_while_identity_5", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_4_1_while_tensorarrayv2read_tensorlistgetitem_encoder_1_lstm_4_1_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "encoder_1_lstm_4_1_while_lstm_cell_1_split_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_4_1_while_lstm_cell_1_split_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_4_1_while_lstm_cell_1_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp", "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_1", "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_2", "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_3", "encoder_1/lstm_4_1/while/lstm_cell_1/split/ReadVariableOp", "encoder_1/lstm_4_1/while/lstm_cell_1/split_1/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/split_1/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/split/ReadVariableOp", "op": "Identity", "input": ["encoder_1_lstm_4_1_while_lstm_cell_1_split_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/split_1/ReadVariableOp", "op": "Identity", "input": ["encoder_1_lstm_4_1_while_lstm_cell_1_split_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp", "op": "Identity", "input": ["encoder_1_lstm_4_1_while_lstm_cell_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_1", "op": "Identity", "input": ["encoder_1_lstm_4_1_while_lstm_cell_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_2", "op": "Identity", "input": ["encoder_1_lstm_4_1_while_lstm_cell_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_3", "op": "Identity", "input": ["encoder_1_lstm_4_1_while_lstm_cell_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/add", "op": "AddV2", "input": ["encoder_1_lstm_4_1_while_placeholder", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/add/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "encoder_1/lstm_4_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["encoder_1_lstm_4_1_while_tensorarrayv2read_tensorlistgetitem_encoder_1_lstm_4_1_tensorarrayunstack_tensorlistfromtensor_0", "encoder_1_lstm_4_1_while_placeholder", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/add_1", "op": "AddV2", "input": ["encoder_1_lstm_4_1_while_encoder_1_lstm_4_1_while_loop_counter", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/add_1/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/split", "op": "Split", "input": ["__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/split/split_dim:output:0", "encoder_1/lstm_4_1/while/lstm_cell_1/split/ReadVariableOp:output:0"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/split_1", "op": "Split", "input": ["__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/split_1/split_dim:output:0", "encoder_1/lstm_4_1/while/lstm_cell_1/split_1/ReadVariableOp:output:0"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice", "op": "StridedSlice", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice/stack:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice/stack_1:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "3"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_1", "op": "StridedSlice", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_1:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_1/stack:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_1/stack_1:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_1/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_2", "op": "StridedSlice", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_2:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_2/stack:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_2/stack_1:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_2/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "encoder_1/lstm_4_1/while/NoOp", "op": "NoOp", "input": ["^encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp", "^encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_1", "^encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_2", "^encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_3", "^encoder_1/lstm_4_1/while/lstm_cell_1/split/ReadVariableOp", "^encoder_1/lstm_4_1/while/lstm_cell_1/split_1/ReadVariableOp"]}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_3", "op": "StridedSlice", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_3:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_3/stack:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_3/stack_1:output:0", "__inference_encoder_1_lstm_4_1_while_body_49730_frozen_827/encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_3/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul", "op": "MatMul", "input": ["encoder_1/lstm_4_1/while/TensorArrayV2Read/TensorListGetItem:item:0", "encoder_1/lstm_4_1/while/lstm_cell_1/split:output:0"], "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["encoder_1/lstm_4_1/while/TensorArrayV2Read/TensorListGetItem:item:0", "encoder_1/lstm_4_1/while/lstm_cell_1/split:output:1"], "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_2", "op": "MatMul", "input": ["encoder_1/lstm_4_1/while/TensorArrayV2Read/TensorListGetItem:item:0", "encoder_1/lstm_4_1/while/lstm_cell_1/split:output:2"], "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_3", "op": "MatMul", "input": ["encoder_1/lstm_4_1/while/TensorArrayV2Read/TensorListGetItem:item:0", "encoder_1/lstm_4_1/while/lstm_cell_1/split:output:3"], "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_4", "op": "MatMul", "input": ["encoder_1_lstm_4_1_while_placeholder_2", "encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice:output:0"], "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_5", "op": "MatMul", "input": ["encoder_1_lstm_4_1_while_placeholder_2", "encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_1:output:0"], "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_6", "op": "MatMul", "input": ["encoder_1_lstm_4_1_while_placeholder_2", "encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_2:output:0"], "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "encoder_1/lstm_4_1/while/Identity_1", "op": "Identity", "input": ["encoder_1_lstm_4_1_while_encoder_1_lstm_4_1_max", "^encoder_1/lstm_4_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "encoder_1/lstm_4_1/while/Identity_2", "op": "Identity", "input": ["encoder_1/lstm_4_1/while/add:z:0", "^encoder_1/lstm_4_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "encoder_1/lstm_4_1/while/Identity", "op": "Identity", "input": ["encoder_1/lstm_4_1/while/add_1:z:0", "^encoder_1/lstm_4_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_7", "op": "MatMul", "input": ["encoder_1_lstm_4_1_while_placeholder_2", "encoder_1/lstm_4_1/while/lstm_cell_1/strided_slice_3:output:0"], "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/add", "op": "AddV2", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/MatMul:product:0", "encoder_1/lstm_4_1/while/lstm_cell_1/split_1:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/add_1", "op": "AddV2", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_1:product:0", "encoder_1/lstm_4_1/while/lstm_cell_1/split_1:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/add_2", "op": "AddV2", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_2:product:0", "encoder_1/lstm_4_1/while/lstm_cell_1/split_1:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/add_3", "op": "AddV2", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_3:product:0", "encoder_1/lstm_4_1/while/lstm_cell_1/split_1:output:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/add_4", "op": "AddV2", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/add:z:0", "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_4:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/add_5", "op": "AddV2", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/add_1:z:0", "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_5:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/add_6", "op": "AddV2", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/add_2:z:0", "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_6:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/add_8", "op": "AddV2", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/add_3:z:0", "encoder_1/lstm_4_1/while/lstm_cell_1/MatMul_7:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/add_4:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/add_5:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/Tanh", "op": "Tanh", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/add_6:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/add_8:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/mul", "op": "Mul", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/Sigmoid_1:y:0", "encoder_1_lstm_4_1_while_placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/mul_1", "op": "Mul", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/Sigmoid:y:0", "encoder_1/lstm_4_1/while/lstm_cell_1/Tanh:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/add_7", "op": "AddV2", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/mul:z:0", "encoder_1/lstm_4_1/while/lstm_cell_1/mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/Tanh_1", "op": "Tanh", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/add_7:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/Identity_5", "op": "Identity", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/add_7:z:0", "^encoder_1/lstm_4_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/lstm_cell_1/mul_2", "op": "Mul", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/Sigmoid_2:y:0", "encoder_1/lstm_4_1/while/lstm_cell_1/Tanh_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["encoder_1_lstm_4_1_while_placeholder_1", "encoder_1_lstm_4_1_while_placeholder", "encoder_1/lstm_4_1/while/lstm_cell_1/mul_2:z:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "encoder_1/lstm_4_1/while/Identity_4", "op": "Identity", "input": ["encoder_1/lstm_4_1/while/lstm_cell_1/mul_2:z:0", "^encoder_1/lstm_4_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder_1/lstm_4_1/while/Identity_3", "op": "Identity", "input": ["encoder_1/lstm_4_1/while/TensorArrayV2Write/TensorListSetItem:output_handle:0", "^encoder_1/lstm_4_1/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}}], "ret": {"encoder_1_lstm_4_1_while_lstm_cell_1_readvariableop_resource": "encoder_1_lstm_4_1_while_lstm_cell_1_readvariableop_resource_0", "encoder_1_lstm_4_1_while_lstm_cell_1_split_readvariableop_resource": "encoder_1_lstm_4_1_while_lstm_cell_1_split_readvariableop_resource_0", "encoder_1_lstm_4_1_while_identity_2": "encoder_1/lstm_4_1/while/Identity_2:output:0", "encoder_1_lstm_4_1_while_lstm_cell_1_split_1_readvariableop_resource": "encoder_1_lstm_4_1_while_lstm_cell_1_split_1_readvariableop_resource_0", "encoder_1_lstm_4_1_while_identity_1": "encoder_1/lstm_4_1/while/Identity_1:output:0", "encoder_1_lstm_4_1_while_identity": "encoder_1/lstm_4_1/while/Identity:output:0", "encoder_1_lstm_4_1_while_identity_4": "encoder_1/lstm_4_1/while/Identity_4:output:0", "encoder_1_lstm_4_1_while_identity_5": "encoder_1/lstm_4_1/while/Identity_5:output:0", "encoder_1_lstm_4_1_while_tensorarrayv2read_tensorlistgetitem_encoder_1_lstm_4_1_tensorarrayunstack_tensorlistfromtensor": "encoder_1_lstm_4_1_while_tensorarrayv2read_tensorlistgetitem_encoder_1_lstm_4_1_tensorarrayunstack_tensorlistfromtensor_0", "encoder_1_lstm_4_1_while_identity_3": "encoder_1/lstm_4_1/while/Identity_3:output:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "controlRet": {"encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_2": "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_2", "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_1": "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_1", "encoder_1/lstm_4_1/while/lstm_cell_1/split_1/ReadVariableOp": "encoder_1/lstm_4_1/while/lstm_cell_1/split_1/ReadVariableOp", "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_3": "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp_3", "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp": "encoder_1/lstm_4_1/while/lstm_cell_1/ReadVariableOp", "encoder_1/lstm_4_1/while/lstm_cell_1/split/ReadVariableOp": "encoder_1/lstm_4_1/while/lstm_cell_1/split/ReadVariableOp"}, "argAttr": {"9": {"attr": {"_user_specified_name": {"s": "cmVzb3VyY2U="}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "ZW5jb2Rlcl8xL2xzdG1fNF8xL3doaWxlL2xvb3BfY291bnRlcg=="}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "ZW5jb2Rlcl8xL2xzdG1fNF8xL01heA=="}}}, "7": {"attr": {"_user_specified_name": {"s": "cmVzb3VyY2U="}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "ZW5jb2Rlcl8xL2xzdG1fNF8xL1RlbnNvckFycmF5VW5zdGFjay9UZW5zb3JMaXN0RnJvbVRlbnNvcg=="}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "64"}]}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "8": {"attr": {"_user_specified_name": {"s": "cmVzb3VyY2U="}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "64"}]}]}}}}}}, {"signature": {"name": "__inference_encoder_1_lstm_5_1_while_body_49947_frozen_829", "inputArg": [{"name": "encoder_1_lstm_5_1_while_encoder_1_lstm_5_1_while_loop_counter", "type": "DT_INT32"}, {"name": "encoder_1_lstm_5_1_while_encoder_1_lstm_5_1_max", "type": "DT_INT32"}, {"name": "encoder_1_lstm_5_1_while_placeholder", "type": "DT_INT32"}, {"name": "encoder_1_lstm_5_1_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "encoder_1_lstm_5_1_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_5_1_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_5_1_while_tensorarrayv2read_tensorlistgetitem_encoder_1_lstm_5_1_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "encoder_1_lstm_5_1_while_lstm_cell_1_split_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_5_1_while_lstm_cell_1_split_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_5_1_while_lstm_cell_1_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "encoder_1_lstm_5_1_while_identity", "type": "DT_INT32"}, {"name": "encoder_1_lstm_5_1_while_identity_1", "type": "DT_INT32"}, {"name": "encoder_1_lstm_5_1_while_identity_2", "type": "DT_INT32"}, {"name": "encoder_1_lstm_5_1_while_identity_3", "type": "DT_VARIANT"}, {"name": "encoder_1_lstm_5_1_while_identity_4", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_5_1_while_identity_5", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_5_1_while_tensorarrayv2read_tensorlistgetitem_encoder_1_lstm_5_1_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "encoder_1_lstm_5_1_while_lstm_cell_1_split_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_5_1_while_lstm_cell_1_split_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "encoder_1_lstm_5_1_while_lstm_cell_1_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["encoder_1/lstm_5_1/while/lstm_cell_1/ReadVariableOp", "encoder_1/lstm_5_1/while/lstm_cell_1/ReadVariableOp_1", "encoder_1/lstm_5_1/while/lstm_cell_1/ReadVariableOp_2", 